MOP/Storage2017-metamop.org
#+SETUPFILE: /home/t844635/Org/common.org
#+TITLE: Solaris EMC to Hitachi Storage Migration
#+AUTHOR: Chris Bayly
#+OPTIONS: toc:2
#+SETUPFILE: /home/t844635/Org/org-html-themes/org/theme-readtheorg.setup


This MOP is only an outline, there are many sections that cannot
describe what will happen on a particular host. And many cases where
you will not know details about the current step until you get there
(i.e. things impossible to capture before the change).  You will need
to adapt this MOP to your host, and blindly following this MOP could
lead to loss of data.

This is also not the original form of this document. If any changes
need to be made, let me (Chris Bayly) know and I'll put them into the
source document.

* Before you start
Here is a list of files/information you should have on hand before you
begin the change.  It's possible this information will already be
around if the system has been scanned as part of the pre-migration
work.

| What                               | Command/URL                      | Why                                                                                                                                        |
|------------------------------------+----------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------|
| Physical Location                  | http://ludb2.corp.ads            | In the worst case you will need someone on-site                                                                                            |
| Full list of zones                 | zoneadm list -civ                | You need to know what was or wasn't running so the server can be brought back to the same state.                                           |
| List of luns and devices           | inq                              | You will need to know the emcpower device name and the long name (c0500....) for each device.                                              |
| Kernel level and host architecture | uname -a                         | Architecture will determine how you label disks.  Kernel version is a basic check to make sure the host is at least Update 3 of Solaris 10 |
| SVM disk data                      | metastat -c                      | No matter what happens during the change you will know where you started.                                                                  |
| eeprom data                        | eeprom                           | Details about existing boot devices                                                                                                        |
| zpool checks                       | zpool iostat -v                  |                                                                                                                                            |
| Sun Healthcheck Data               | cat /root/sunhlth/`hostname`.out | How healthy was the host.  Did the migration make it better or worse?                                                                      |
|------------------------------------+----------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------|
* Solaris 8 & 9 notes
** Getting HBA WWN's 
#+BEGIN_EXAMPLE sh
#!/bin/sh
for i in `cfgadm |grep fc-fabric|awk '{print $1}'`;
do
  dev="`cfgadm -lv $i|grep devices |awk '{print $NF}'`" 
  wwn="`luxadm -e dump_map $dev |grep 'Host Bus'|awk '{print $4}'`"
echo "$i: $wwn"
done
#+END_EXAMPLE
** Force (re)install of SPS before reboot after PowerPath removal.
sedm3424 experienced hard lockups when using an older version of ledville.
** Read [[http://qadev115/wiki/index.php/SEDM1046_-_Hitachi_Storage_Migration_Test#Install_SFS_stack_.28aka_Leadville.29][Kurts migration]] especially the parts about installing the SFS stack and the FCA utilities.
* Rebooting SPARC and x86 Architecture hosts.

Solaris on SPARC and x86 have some fundamental differences in how the
handle disks and how they handle booting in a mirrored setup.  The
info in this section detailing how to boot to either side of the
mirror should be applied to any reboot required during the change.
This section will detail how to either side of the mirrored root
disks.

** Reboots on x86
*** Modify grub on x86 hardware.
  If we are on an x86 arch host ("arch" returns i86pc) we will want to
  edit /boot/grub/menu.lst and add in the backout entry. Quite likely
  you will want to add this stanza to the end of the file (checking that
  there isn't one already there.)

#+BEGIN_EXAMPLE
title Solaris BACKOUT DISK
root (hd1,0,a)
kernel /platform/i86pc/multiboot
module /platform/i86pc/boot_archive
#+END_EXAMPLE

  The grub name for hd1 here will have to be discovered by the SA.  They
  are LIKELY hd0 for the initial disk and hd1 for the second but there
  is nothing that guarantees this... Gotta love x86 hardware.
