Exports/Storage2017-metamop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-17 Fri 12:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solaris EMC to Hitachi Storage Migration</title>
<meta name="author" content=" Chris Bayly" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Solaris EMC to Hitachi Storage Migration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org613b20b">1. Before you start</a></li>
<li><a href="#orga97f01a">2. Solaris 8 &amp; 9 notes</a>
<ul>
<li><a href="#org1f3c12b">2.1. Getting HBA WWN's</a></li>
<li><a href="#org4718d1f">2.2. Force (re)install of SPS before reboot after PowerPath removal.</a></li>
<li><a href="#orgd9df06f">2.3. Read Kurts migration especially the parts about installing the SFS stack and the FCA utilities.</a></li>
</ul>
</li>
<li><a href="#orgbfeac8c">3. Rebooting SPARC and x86 Architecture hosts.</a>
<ul>
<li><a href="#orgf50560b">3.1. Reboots on x86</a></li>
<li><a href="#org509658e">3.2. Rebooting split mirrors on SPARC</a></li>
</ul>
</li>
<li><a href="#orgc9f5df6">4. Labeling, Partitioning, Slices, and EMC naming conventions</a>
<ul>
<li><a href="#orgb08b22e">4.1. Partitioning (Solaris x86 only).</a></li>
<li><a href="#orga2fae91">4.2. Labeling and Slices</a></li>
<li><a href="#org565dd8a">4.3. EMC PowerPath disk naming</a></li>
</ul>
</li>
<li><a href="#org2d6a0d0">5. Break the root and var mirrors</a></li>
<li><a href="#org3be6a2b">6. Prepare the host for upgrading</a></li>
<li><a href="#org942ff63">7. Export ZFS pools BEFORE powerpath goes away</a></li>
<li><a href="#org8fa51b4">8. Remove EMC PowerPath</a>
<ul>
<li><a href="#org4d75f9e">8.1. (Optionally) Reboot the host and reconfigure:</a></li>
</ul>
</li>
<li><a href="#orgb2e821b">9. Enable MPXIO</a></li>
<li><a href="#orgd82c761">10. Fix up the md.tab</a></li>
<li><a href="#org16695ab">11. Fix the metadevices</a></li>
<li><a href="#org7871963">12. Preparation of destination (Hitachi) disks</a></li>
<li><a href="#org6968e0a">13. Mirroring the disks (why we are here&#x2026;)</a>
<ul>
<li><a href="#org90a2a98">13.1. Metadevices without existing mirror devices</a></li>
<li><a href="#org427ddee">13.2. Metadevices with existing mirror devices</a></li>
<li><a href="#org70cc140">13.3. After the mirroring starts</a></li>
</ul>
</li>
<li><a href="#org7a1702b">14. Things to do before the end of the change</a>
<ul>
<li><a href="#org7eca0f3">14.1. Restore the autoboot flag to the zones that were modified in "Prepare the host for upgrading":</a></li>
<li><a href="#orgf1f4dc1">14.2. Fix /etc/vfstab</a></li>
<li><a href="#orga7560fd">14.3. (Optional) Sync root &amp; /var mirrors</a></li>
<li><a href="#org6a38c78">14.4. Check the state of the system bootlist (eeprom)</a></li>
<li><a href="#org0b043de">14.5. Final sanity reboot and checks of above steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This MOP is only an outline, there are many sections that cannot
describe what will happen on a particular host. And many cases where
you will not know details about the current step until you get there
(i.e. things impossible to capture before the change).  You will need
to adapt this MOP to your host, and blindly following this MOP could
lead to loss of data.
</p>

<p>
This is also not the original form of this document. If any changes
need to be made, let me (Chris Bayly) know and I'll put them into the
source document.
</p>
<div id="outline-container-org613b20b" class="outline-2">
<h2 id="org613b20b"><span class="section-number-2">1.</span> Before you start</h2>
<div class="outline-text-2" id="text-1">
<p>
Here is a list of files/information you should have on hand before you
begin the change.  It's possible this information will already be
around if the system has been scanned as part of the pre-migration
work.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">What</th>
<th scope="col" class="org-left">Command/URL</th>
<th scope="col" class="org-left">Why</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Physical Location</td>
<td class="org-left"><a href="http://ludb2.corp.ads">http://ludb2.corp.ads</a></td>
<td class="org-left">In the worst case you will need someone on-site</td>
</tr>

<tr>
<td class="org-left">Full list of zones</td>
<td class="org-left">zoneadm list -civ</td>
<td class="org-left">You need to know what was or wasn't running so the server can be brought back to the same state.</td>
</tr>

<tr>
<td class="org-left">List of luns and devices</td>
<td class="org-left">inq</td>
<td class="org-left">You will need to know the emcpower device name and the long name (c0500&#x2026;.) for each device.</td>
</tr>

<tr>
<td class="org-left">Kernel level and host architecture</td>
<td class="org-left">uname -a</td>
<td class="org-left">Architecture will determine how you label disks.  Kernel version is a basic check to make sure the host is at least Update 3 of Solaris 10</td>
</tr>

<tr>
<td class="org-left">SVM disk data</td>
<td class="org-left">metastat -c</td>
<td class="org-left">No matter what happens during the change you will know where you started.</td>
</tr>

<tr>
<td class="org-left">eeprom data</td>
<td class="org-left">eeprom</td>
<td class="org-left">Details about existing boot devices</td>
</tr>

<tr>
<td class="org-left">zpool checks</td>
<td class="org-left">zpool iostat -v</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sun Healthcheck Data</td>
<td class="org-left">cat /root/sunhlth/`hostname`.out</td>
<td class="org-left">How healthy was the host.  Did the migration make it better or worse?</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga97f01a" class="outline-2">
<h2 id="orga97f01a"><span class="section-number-2">2.</span> Solaris 8 &amp; 9 notes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1f3c12b" class="outline-3">
<h3 id="org1f3c12b"><span class="section-number-3">2.1.</span> Getting HBA WWN's</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example" id="orga376af1">
#!/bin/sh
for i in `cfgadm |grep fc-fabric|awk '{print $1}'`;
do
  dev="`cfgadm -lv $i|grep devices |awk '{print $NF}'`" 
  wwn="`luxadm -e dump_map $dev |grep 'Host Bus'|awk '{print $4}'`"
echo "$i: $wwn"
done
</pre>
</div>
</div>
<div id="outline-container-org4718d1f" class="outline-3">
<h3 id="org4718d1f"><span class="section-number-3">2.2.</span> Force (re)install of SPS before reboot after PowerPath removal.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
sedm3424 experienced hard lockups when using an older version of ledville.
</p>
</div>
</div>
<div id="outline-container-orgd9df06f" class="outline-3">
<h3 id="orgd9df06f"><span class="section-number-3">2.3.</span> Read <a href="http://qadev115/wiki/index.php/SEDM1046_-_Hitachi_Storage_Migration_Test#Install_SFS_stack_.28aka_Leadville.29">Kurts migration</a> especially the parts about installing the SFS stack and the FCA utilities.</h3>
</div>
</div>
<div id="outline-container-orgbfeac8c" class="outline-2">
<h2 id="orgbfeac8c"><span class="section-number-2">3.</span> Rebooting SPARC and x86 Architecture hosts.</h2>
<div class="outline-text-2" id="text-3">
<p>
Solaris on SPARC and x86 have some fundamental differences in how the
handle disks and how they handle booting in a mirrored setup.  The
info in this section detailing how to boot to either side of the
mirror should be applied to any reboot required during the change.
This section will detail how to either side of the mirrored root
disks.
</p>
</div>
<div id="outline-container-orgf50560b" class="outline-3">
<h3 id="orgf50560b"><span class="section-number-3">3.1.</span> Reboots on x86</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgcc77cbd" class="outline-4">
<h4 id="orgcc77cbd"><span class="section-number-4">3.1.1.</span> Modify grub on x86 hardware.</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
If we are on an x86 arch host ("arch" returns i86pc) we will want to
edit /boot/grub/menu.lst and add in the backout entry. Quite likely
you will want to add this stanza to the end of the file (checking that
there isn't one already there.)
</p>

<pre class="example" id="org2bbcebb">
title Solaris BACKOUT DISK
root (hd1,0,a)
kernel /platform/i86pc/multiboot
module /platform/i86pc/boot_archive
</pre>

<p>
The grub name for hd1 here will have to be discovered by the SA.  They
are LIKELY hd0 for the initial disk and hd1 for the second but there
is nothing that guarantees this&#x2026; Gotta love x86 hardware.
</p>
</div>
</div>
