MOP/Storage2017-metamop.org
*** Rebooting split mirrors on x86

 To successfully reboot between the two sides of the split mirrors on
 x86 requires editing a few files.

 First, edit /boot/solaris/bootenv.rc and edit the line that sets the
 bootpath, and make it use the second disk.  For the example host I'm
 using it looks like this before the edit:

 #+BEGIN_EXAMPLE
 setprop bootpath '/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@0,0:a'
 #+END_EXAMPLE

 And this after the edit:
 #+BEGIN_EXAMPLE
 setprop bootpath '/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@1,0:a'
 #+END_EXAMPLE

 Your host might be different, so here's how you can find the device
 names for the two disks.  This line assumes that the mirror split
 above has been completed.  If for what ever reason this script doesn't
 work, look at the disk device backing d0 and d90 and do an ls against
 slice zero of that disk.

 #+BEGIN_EXAMPLE
 # for blah in `(metastat d0 | tail -1 ; metastat d90 | tail -1 ) | awk '{print $1;}'`  ; do ls -ld /dev/dsk/${blah}s0 ; done
 lrwxrwxrwx   1 root     root          58 Nov 21  2007 /dev/dsk/c2t0d0s0 -> ../../devices/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@0,0:a
 lrwxrwxrwx   1 root     root          58 Nov 21  2007 /dev/dsk/c2t1d0s0 -> ../../devices/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@1,0:a
 #+END_EXAMPLE

 Note the PCI device names that are linked to.

 After this change is complete reboot the host and choose the backout disk from the menu.
 #+BEGIN_EXAMPLE
 # reboot
 #+END_EXAMPLE

 Check that you are on the backout disk.

 #+BEGIN_EXAMPLE
 # df -k / /var
 Filesystem            kbytes    used   avail capacity  Mounted on
 /dev/md/dsk/d90      8266719 1649464 6534588    21%    /
 /dev/md/dsk/d93      8266719 1221881 6962171    15%    /var
 # ls -ld /*disk* /var/*disk*
 -rw-r--r--   1 root     root           0 Oct 11 00:58 /backoutdisk
 -rw-r--r--   1 root     root           0 Oct 11 00:58 /var/backoutvardisk
 #+END_EXAMPLE

 Reboot back to the change disk, choosing the normal entry in grub.

 #+BEGIN_EXAMPLE
 # reboot
 #+END_EXAMPLE

 Verify you are back on the disk we are going to change:

 #+BEGIN_EXAMPLE
 # df -k / /var
 Filesystem            kbytes    used   avail capacity  Mounted on
 /dev/md/dsk/d0       8266719 1649464 6534588    21%    /
 /dev/md/dsk/d3       8266719 1221881 6962171    15%    /var
 # ls -ld /*disk* /var/*disk*
 -rw-r--r--   1 root     root           0 Oct 11 00:58 /changedisk
 -rw-r--r--   1 root     root           0 Oct 11 00:58 /var/changevardisk
 #+END_EXAMPLE

** Rebooting split mirrors on SPARC
On SPARC hardware tell the proms which disk you want...
#+BEGIN_EXAMPLE
# reboot md-rootdisk1
#+END_EXAMPLE

Verify that the backout environment is sane (everything mounts, /var/
is running on the mirror copy, etc).  Fix ANYTHING that seems out of
place at this point. Check for the existence of /backoutdisk!

#+BEGIN_EXAMPLE
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d90      8266719 1649464 6534588    21%    /
/dev/md/dsk/d93      8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /backoutdisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/backoutvardisk
#+END_EXAMPLE


Reboot back to the change environment to begin the change:

#+BEGIN_EXAMPLE
# reboot md-rootdisk0
#+END_EXAMPLE

Verify you are on the change disk side of the mirror.

#+BEGIN_EXAMPLE
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d0      8266719 1649464 6534588    21%    /
/dev/md/dsk/d3      8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /changedisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/changevardisk
#+END_EXAMPLE
* Labeling, Partitioning, Slices, and EMC naming conventions
There are at least 4 different ways that disks are named in Solaris.
Each of them is involved in most changes so it's important to
recognize them.
** Partitioning (Solaris x86 only).
Solaris running on x86 hardware uses the PC BIOS naming convention for
disks.  This convention places a partition table at the front edge of
the disk and divides it in up to 4 physical partitions starting on
cylinder boundaries.  On top of these 4 physical partitions there can
be an arbitrary number of logical partitions contained in one of the 4
physical.  Inside Solaris these partitions are designated with device
names like the following (showing partitions 0 and 1):

#+BEGIN_EXAMPLE
/dev/dsk/c0t0d0p0
/dev/dsk/c0t0d0p1
#+END_EXAMPLE

Luckily most of the details of this can be avoided in the TELUS
Environment as we generally only use the first PC BIOS partition on
the disk (p0).  This partition is set up with a command something like
this:

#+BEGIN_EXAMPLE
fdisk -B /dev/rdsk/c8t1d2p0
#+END_EXAMPLE
