Exports/Storage2017-metamop.html
<div id="outline-container-orga4ac0ba" class="outline-4">
<h4 id="orga4ac0ba"><span class="section-number-4">3.1.2.</span> Rebooting split mirrors on x86</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
To successfully reboot between the two sides of the split mirrors on
x86 requires editing a few files.
</p>

<p>
First, edit /boot/solaris/bootenv.rc and edit the line that sets the
bootpath, and make it use the second disk.  For the example host I'm
using it looks like this before the edit:
</p>

<pre class="example" id="orgb025c1d">
setprop bootpath '/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@0,0:a'
</pre>

<p>
And this after the edit:
</p>
<pre class="example" id="orgb15ceec">
setprop bootpath '/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@1,0:a'
</pre>

<p>
Your host might be different, so here's how you can find the device
names for the two disks.  This line assumes that the mirror split
above has been completed.  If for what ever reason this script doesn't
work, look at the disk device backing d0 and d90 and do an ls against
slice zero of that disk.
</p>

<pre class="example" id="org85fe9fb">
# for blah in `(metastat d0 | tail -1 ; metastat d90 | tail -1 ) | awk '{print $1;}'`  ; do ls -ld /dev/dsk/${blah}s0 ; done
lrwxrwxrwx   1 root     root          58 Nov 21  2007 /dev/dsk/c2t0d0s0 -&gt; ../../devices/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@0,0:a
lrwxrwxrwx   1 root     root          58 Nov 21  2007 /dev/dsk/c2t1d0s0 -&gt; ../../devices/pci@0,0/pci10de,5d@c/pci1000,1000@0/sd@1,0:a
</pre>

<p>
Note the PCI device names that are linked to.
</p>

<p>
After this change is complete reboot the host and choose the backout disk from the menu.
</p>
<pre class="example" id="org8e0b9a8">
# reboot
</pre>

<p>
Check that you are on the backout disk.
</p>

<pre class="example" id="org011deaa">
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d90      8266719 1649464 6534588    21%    /
/dev/md/dsk/d93      8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /backoutdisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/backoutvardisk
</pre>

<p>
Reboot back to the change disk, choosing the normal entry in grub.
</p>

<pre class="example" id="org9b956d2">
# reboot
</pre>

<p>
Verify you are back on the disk we are going to change:
</p>

<pre class="example" id="org9d63381">
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d0       8266719 1649464 6534588    21%    /
/dev/md/dsk/d3       8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /changedisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/changevardisk
</pre>
</div>
</div>
</div>
<div id="outline-container-org509658e" class="outline-3">
<h3 id="org509658e"><span class="section-number-3">3.2.</span> Rebooting split mirrors on SPARC</h3>
<div class="outline-text-3" id="text-3-2">
<p>
On SPARC hardware tell the proms which disk you want&#x2026;
</p>
<pre class="example" id="org89869ec">
# reboot md-rootdisk1
</pre>

<p>
Verify that the backout environment is sane (everything mounts, /var/
is running on the mirror copy, etc).  Fix ANYTHING that seems out of
place at this point. Check for the existence of /backoutdisk!
</p>

<pre class="example" id="org6c8bd47">
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d90      8266719 1649464 6534588    21%    /
/dev/md/dsk/d93      8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /backoutdisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/backoutvardisk
</pre>


<p>
Reboot back to the change environment to begin the change:
</p>

<pre class="example" id="org90d7491">
# reboot md-rootdisk0
</pre>

<p>
Verify you are on the change disk side of the mirror.
</p>

<pre class="example" id="orgcc2180c">
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d0      8266719 1649464 6534588    21%    /
/dev/md/dsk/d3      8266719 1221881 6962171    15%    /var
# ls -ld /*disk* /var/*disk*
-rw-r--r--   1 root     root           0 Oct 11 00:58 /changedisk
-rw-r--r--   1 root     root           0 Oct 11 00:58 /var/changevardisk
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9f5df6" class="outline-2">
<h2 id="orgc9f5df6"><span class="section-number-2">4.</span> Labeling, Partitioning, Slices, and EMC naming conventions</h2>
<div class="outline-text-2" id="text-4">
<p>
There are at least 4 different ways that disks are named in Solaris.
Each of them is involved in most changes so it's important to
recognize them.
</p>
</div>
<div id="outline-container-orgb08b22e" class="outline-3">
<h3 id="orgb08b22e"><span class="section-number-3">4.1.</span> Partitioning (Solaris x86 only).</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Solaris running on x86 hardware uses the PC BIOS naming convention for
disks.  This convention places a partition table at the front edge of
the disk and divides it in up to 4 physical partitions starting on
cylinder boundaries.  On top of these 4 physical partitions there can
be an arbitrary number of logical partitions contained in one of the 4
physical.  Inside Solaris these partitions are designated with device
names like the following (showing partitions 0 and 1):
</p>

<pre class="example" id="orgfde0f15">
/dev/dsk/c0t0d0p0
/dev/dsk/c0t0d0p1
</pre>

<p>
Luckily most of the details of this can be avoided in the TELUS
Environment as we generally only use the first PC BIOS partition on
the disk (p0).  This partition is set up with a command something like
this:
</p>

<pre class="example" id="orgb7b7a2a">
fdisk -B /dev/rdsk/c8t1d2p0
</pre>
</div>
</div>
