Exports/Storage2017-metamop.html
<div id="outline-container-orga2fae91" class="outline-3">
<h3 id="orga2fae91"><span class="section-number-3">4.2.</span> Labeling and Slices</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Solaris naturally divides the disk into slices, that are tracked in a
portion of the disk called the VTOC (Volume Table of Contents).  Each
of these slices are defined by a starting cylinder and a size.  The
slices are number from 0 - 7 on SPARC and 0 - 9 on x86.  The slices 2,
8 and 9 are reserved for use by the system.  Most notably slice 2 is
reserved to be the "all slice" that has a size equal to the entire
disk.
</p>

<p>
There are two methods that these slices can be read through, in block
mode (all reads always return an entire 512 byte sector), or in
character mode where the device is accessed through byte addressable
methods.  Here is an example of device names for slice 0 on a disk in
both block (/dev/dsk/) and in character modes (/dev/rdsk):
</p>

<pre class="example" id="org7018869">
/dev/dsk/c2t0d0s0
/dev/rdsk/c2t0d0s0
</pre>

<p>
There are two main ways to determine the layout of the disk slices on
a disk.  The first is to dump the VTOC label directly like this (note
the use of the all slice):
</p>

<pre class="example" id="orgb2d79c7">
root@sedm1817:~# prtvtoc /dev/rdsk/c2t0d0s2
* /dev/rdsk/c2t0d0s2 partition map
*
* Dimensions:
*     512 bytes/sector
*      63 sectors/track
*     255 tracks/cylinder
*   16065 sectors/cylinder
*    8923 cylinders
*    8921 accessible cylinders
*
* Flags:
*   1: unmountable
*  10: read-only
*
*                          First     Sector    Last
* Partition  Tag  Flags    Sector     Count    Sector  Mount Directory
       0      2    00   32531625  16787925  49319549
       1      3    01      16065  32515560  32531624
       2      5    00          0 143315865 143315864
       3      7    00   49319550  16787925  66107474
       4      8    00   66107475   1060290  67167764
       5      6    01   67167765  10490445  77658209
       6      6    01   77658210  65625525 143283734
       7     11    01  143283735     32130 143315864
       8      1    01          0     16065     16064
</pre>

<p>
We can see that this disk has 8 defined slices (so this must be an x86
host), and you can see that slice 2 covers the entire disk from first
sector to last.
</p>

<p>
The second way to look at the slices on a disk is to use the format
command.  Shown here is a shortcut to display the slices.
</p>

<pre class="example" id="orgfd888b9">
root@sedm1817:~# printf "p\np\n" | format c2t0d0s2
selecting c2t0d0s2
[disk formatted]
/dev/dsk/c2t0d0s0 is part of SVM volume stripe:d10. Please see metaclear(1M).
/dev/dsk/c2t0d0s1 is part of SVM volume stripe:d11. Please see metaclear(1M).
/dev/dsk/c2t0d0s3 is part of SVM volume stripe:d13. Please see metaclear(1M).
/dev/dsk/c2t0d0s4 is part of SVM volume stripe:d14. Please see metaclear(1M).
/dev/dsk/c2t0d0s5 is part of active ZFS pool tools. Please see zpool(1M).
/dev/dsk/c2t0d0s6 is part of SVM volume stripe:d16. Please see metaclear(1M).
/dev/dsk/c2t0d0s7 contains an SVM mdb. Please see metadb(1M).


FORMAT MENU:
        disk       - select a disk
        type       - select (define) a disk type
        partition  - select (define) a partition table
        current    - describe the current disk
        format     - format and analyze the disk
        fdisk      - run the fdisk program
        repair     - repair a defective sector
        label      - write label to the disk
        analyze    - surface analysis
        defect     - defect list management
        backup     - search for backup labels
        verify     - read and display labels
        save       - save new disk/partition definitions
        inquiry    - show vendor, product and revision
        volname    - set 8-character volume name
        !&lt;cmd&gt;     - execute &lt;cmd&gt;, then return
        quit
format&gt;

PARTITION MENU:
        0      - change `0' partition
        1      - change `1' partition
        2      - change `2' partition
        3      - change `3' partition
        4      - change `4' partition
        5      - change `5' partition
        6      - change `6' partition
        7      - change `7' partition
        select - select a predefined table
        modify - modify a predefined partition table
        name   - name the current table
        print  - display the current table
        label  - write partition map and label to the disk
        !&lt;cmd&gt; - execute &lt;cmd&gt;, then return
        quit
partition&gt; Current partition table (original):
Total disk cylinders available: 8921 + 2 (reserved cylinders)

Part      Tag    Flag     Cylinders        Size            Blocks
  0       root    wm    2025 - 3069        8.01GB    (1045/0/0)  16787925
  1       swap    wu       1 - 2024       15.50GB    (2024/0/0)  32515560
  2     backup    wm       0 - 8920       68.34GB    (8921/0/0) 143315865
  3        var    wm    3070 - 4114        8.01GB    (1045/0/0)  16787925
  4       home    wm    4115 - 4180      517.72MB    (66/0/0)     1060290
  5      stand    wu    4181 - 4833        5.00GB    (653/0/0)   10490445
  6      stand    wu    4834 - 8918       31.29GB    (4085/0/0)  65625525
  7   reserved    wu    8919 - 8920       15.69MB    (2/0/0)        32130
  8       boot    wu       0 -    0        7.84MB    (1/0/0)        16065
  9 unassigned    wu       0               0         (0/0/0)            0

partition&gt;
root@sedm1817:~#
</pre>
</div>
</div>
<div id="outline-container-org565dd8a" class="outline-3">
<h3 id="org565dd8a"><span class="section-number-3">4.3.</span> EMC PowerPath disk naming</h3>
<div class="outline-text-3" id="text-4-3">
<p>
EMC PowerPath on Solaris names disks slightly differently than stock
Solaris.  When set up, PowerPath discovers all of the paths to a
particular disk on a SAN, and gives them a Pseudo name something like
"emcpower2a".  You can interrogate this name with the following command:
</p>

<pre class="example" id="org8825bdc">
root@sedm1817:~# /etc/powermt display dev=emcpower2a
Pseudo name=emcpower2a
CLARiiON ID=APM00062606926
Logical device ID=6006016045AB1A00B24F60C1E6A8DC11
state=alive; policy=CLAROpt; priority=0; queued-IOs=0
Owner: default=SP B, current=SP B
==============================================================================
---------------- Host ---------------   - Stor -   -- I/O Path -  -- Stats ---
###  HW Path                I/O Paths    Interf.   Mode    State  Q-IOs Errors
==============================================================================
3073 pci@0,0/pci10de,5d@d/pci10df,fc2e@0,1/fp@0,0 c4t5006016239A0111Ed1s0 SP A2     active  alive      0      1
3073 pci@0,0/pci10de,5d@d/pci10df,fc2e@0,1/fp@0,0 c4t5006016A39A0111Ed1s0 SP B2     active  alive      0      1
</pre>

<p>
There is a lot of information available, but what is of interest right
now is the Pseudo name.  emcpower2a describes a disk (emcpower2) and
it's first slice (a).  The second slice on that disk is named
emcpower2b, and so on.
</p>

<p>
Pay close attention to the letter designating the slice as it is easy
to get confused with the naming conventions.  If the disk name is
being converted from PowerPath to native naming emcpower2a will always
refer to the first slice (s0) on a disk.  So for example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">emcpower2a</td>
<td class="org-left">c5t0d0s0</td>
</tr>

<tr>
<td class="org-left">emcpower2b</td>
<td class="org-left">c5t0d0s1</td>
</tr>

<tr>
<td class="org-left">emcpower2c</td>
<td class="org-left">c5t0d0s2</td>
</tr>
</tbody>
</table>

<p>
I've chosen the c5t0d0 portion of the name at random, but the name of
the slices is what's important.
</p>
</div>
</div>
</div>
