Exports/Storage2017-metamop.html
<div id="outline-container-org2d6a0d0" class="outline-2">
<h2 id="org2d6a0d0"><span class="section-number-2">5.</span> Break the root and var mirrors</h2>
<div class="outline-text-2" id="text-5">
<pre class="example" id="orgb9085db">
# df -k / /var
Filesystem            kbytes    used   avail capacity  Mounted on
/dev/md/dsk/d0       8262869 6438082 1742159    79%    /
/dev/md/dsk/d3       8262869 5164906 3015335    64%    /var
</pre>

<p>
Grab the meta devices that root and var are mounted on, for this
example I'm assuming d0 and d3.  All of the drive names (meta and raw
devices) are examples for the purpose of making this MOP coherent,
your metadevices and device names will likely be different.
</p>

<pre class="example" id="org82480f9">
# metastat -p d0 d3
d0 -m d10 d20 1
d10 1 1 c0t0d0s0
d20 1 1 c0t1d0s0
d3 -m d13 d23 1
d13 1 1 c0t0d0s3
d23 1 1 c0t1d0s3
</pre>

<p>
Make note of the raw devices for each metadevice.   Detach the backout disk:
</p>

<pre class="example" id="org1a50c0a">
sync ; sync ; sync
metadetach d0 d20
metadetach d3 d23
</pre>

<p>
Create a new boot mirror for the backout disk and mount it.
</p>

<pre class="example" id="org32b9a54">
metainit d90 -m d20
metainit d93 -m d23
fsck -y /dev/md/rdsk/d90
fsck -y /dev/md/rdsk/d93
mount /dev/md/dsk/d90 /a
mount /dev/md/dsk/d93 /a/var
</pre>

<p>
Modify the backout environment to allow it to boot cleanly.
</p>

<pre class="example" id="org00f76d9">
metaroot -k /a/etc/system -v /a/etc/vfstab d90
grep rootdev /a/etc/system   # Make sure its d90
grep var /a/etc/vfstab       # Make sure its d93 change /a/etc/vfstab if its not
touch /a/backoutdisk
touch /a/var/backoutvardisk
# Create the devices for our newly created MD mirrors
ls -l /dev/md/*dsk/d9[03]|nawk '{printf "ln -s %s /a%s\n", $NF, $(NF-2)}'
ln -s ../../../devices/pseudo/md@0:0,90,blk /a/dev/md/dsk/d90
ln -s ../../../devices/pseudo/md@0:0,93,blk /a/dev/md/dsk/d93
ln -s ../../../devices/pseudo/md@0:0,90,raw /a/dev/md/rdsk/d90
ln -s ../../../devices/pseudo/md@0:0,93,raw /a/dev/md/rdsk/d93
touch /changedisk            # Touch files to make sure we know which environment we are on
touch /var/changevardisk     # also one for /var
bootadm update-archive -v -R /a   # this might be dependant on the version of solaris if you are on SPARC hardware?!?
bootadm update-archive -v         # this might be dependant on the version of solaris if you are on SPARC hardware?!?
umount /a/var
umount /a
</pre>

<p>
Reboot to the backout disk to make sure the backout will work. Refer to the section <a href="#orgbfeac8c">Rebooting SPARC and x86 Architecture hosts.</a>
</p>
</div>
</div>
<div id="outline-container-org3be6a2b" class="outline-2">
<h2 id="org3be6a2b"><span class="section-number-2">6.</span> Prepare the host for upgrading</h2>
<div class="outline-text-2" id="text-6">
<p>
Check the output of the zone information gathered in "<a href="#org613b20b">Before you
start</a>", for all of the running zones set their autoboot property to
false so they do not interfere with later disk mounts and
unmounts. Run the following shell script:
</p>

<pre class="example" id="orgfd49551">
for blah in `zoneadm list -civ | awk '/running    \/zones/ {print $2;}'`
 do zonecfg -z $blah set autoboot=false
done
</pre>

<p>
Comment out any mounts of the disks we are going to be modifying,
basically all non-system mounts on metadisks.  In particular many of
our systems have entries for filesystems in /zones/ like this:
</p>

<pre class="example" id="org4b2bbea">
/dev/md/dsk/d82         /dev/md/rdsk/d82        /zloop/sedm1825/apps/infra/weblogic     ufs     3       yes     logging
/dev/md/dsk/d83         /dev/md/rdsk/d83        /zloop/sedm1825/apps/infra/java ufs     3       yes     logging

### ZONES ###
#/dev/md/dsk/d100      /dev/md/rdsk/d100       /zones/sedm1825ca       ufs     3       yes     logging
/dev/md/dsk/d120        /dev/md/rdsk/d120       /zones/sedm1825cb       ufs     3       yes     logging
/dev/md/dsk/d140        /dev/md/rdsk/d140       /zones/sedm1825cc       ufs     3       yes     logging
/dev/md/dsk/d160        /dev/md/rdsk/d160       /zones/sedm1825cd       ufs     3       yes     logging
</pre>

<p>
At this point you can either shutdown all the zones manually, and then
unmount all of the filesystems on disks we will be working on, or you
can reboot the host.  You will also want to run "unshareall" before
unmounting the filesystes, in case they are being used for NFS
exports. Refer to the section <a href="#orgbfeac8c">Rebooting SPARC and x86 Architecture
hosts</a> if you decide to reboot the host.
</p>
</div>
</div>
<div id="outline-container-org942ff63" class="outline-2">
<h2 id="org942ff63"><span class="section-number-2">7.</span> Export ZFS pools BEFORE powerpath goes away</h2>
<div class="outline-text-2" id="text-7">
<p>
Before PowerPath is removed from the host, and before MPXIO takes over
as the multipathing agent, we need to take care of the ZFS
filesystems.  This is done out of order due to how ZFS stores device
information in its database (the ZDB).  It will not Lets look at a sample ZFS pool
to use for an example.
</p>

<pre class="example" id="org45d5695">
# zpool iostat -v wikipool
                capacity     operations    bandwidth
pool          used  avail   read  write   read  write
-----------  -----  -----  -----  -----  -----  -----
wikipool     75.8G  28.7G      5      0   673K  1.01K
  emcpower0a 75.8G  28.7G      5      0   673K  1.01K
-----------  -----  -----  -----  -----  -----  -----
</pre>

<p>
Our pool is backed by a single EMC disk emcpower0a.  We need to select
a Hitachi LUN to mirror this to from the list.
</p>

<pre class="example" id="org78ffd95">
# inq -no_dots
... &lt; cut lines &gt; ...
/dev/rdsk/c2t3d14s2 :HITACHI :OPEN-V          :8001  :5030DC40   :110100480
... &lt; cut lines &gt; ...
</pre>

<p>
Now we need to attach the new storage to the pool, in ZFS terms
attaching a volume will mirror the existing disk to the new one.
(Read the man pages on "zpool" if this operation involves more than a
single new LUN).
</p>

<p>
Prepare the new Hitachi LUN for writing.  We want to duplicate the
disk layout of the original disk.  If the new LUN is larger than the
original LUN, it is okay if the new partitions are larger than the
originals, but they CANNOT be smaller.
</p>

<pre class="example" id="org058a7c7">
# fdisk -B /dev/rdsk/c2t3d14s2   # if on x86
# format /dev/rdsk/c2t3d14s2
...  ensure that the slices match the original disk (s0 in our case) ...
# zpool attach wikipool emcpower0a c2t3d14s0
#+END_EXAMPLE# zpool status wikipool

At this point the pool should be resilvering the data.  Once this is
complete, it might take a while, we want to remove the EMC disk from
the pool, and then export it.  The -f flag to "zpool export" will
unmount any active filesystems.

#+BEGIN_EXAMPLE
# zpool detach wikipool emcpower0a
# zpool export -f wikipool
</pre>

<p>
Repeat these steps for all ZFS pools.  They can be done serially or in parallel.
</p>
</div>
</div>
<div id="outline-container-org8fa51b4" class="outline-2">
<h2 id="org8fa51b4"><span class="section-number-2">8.</span> Remove EMC PowerPath</h2>
<div class="outline-text-2" id="text-8">
<p>
Keep a copy if the inq output from before you remove powerpath.  This
will be used to fix up the metadisks later and is required.  You can
also use the scans run on the host before the change if they are
available.
</p>

<pre class="example" id="org19b217c">
pkgrm EMCpower
/etc/emcp_cleanup
</pre>

<p>
The cleanup script removes the EMC disk definitions from /dev/dsk/ and
removes any of the existing setup of PowerPath, including:
</p>

<pre class="example" id="orga0c41f6">
/etc/emcp_registration 
/etc/emcp_devicesDB.dat  
/etc/emcp_devicesDB.idx
</pre>

<p>
If anything goes wrong later in the change the backout side will have
copies of these files, if copies are required.  Do NOT modify the
backout filesystems if you need copies of them.
</p>
</div>
