MOP/Storage2017-metamop.org
** (Optionally) Reboot the host and reconfigure:
Its generally possible to install MPXIO (the next step) before the
reboot of the system.  If you are unsure of the state of the system
after removing PowerPath, or otherwise don't feel comfortable with
this, reboot!

#+BEGIN_EXAMPLE
touch /reconfigure
#+END_EXAMPLE

Then follow the reboot method needed from the section [[*Rebooting SPARC and x86 Architecture hosts.][Rebooting SPARC and x86 Architecture hosts]].
Ensure that you see /changedisk after the reboot.
* Enable MPXIO

NOTE: This section does not apply to Solaris10 U4 and earlier.
stmsboot should be there in U4 but appears to be AWOL in the TELUS
image (or maybe it was missing in the U4 release we got 8 years ago?).
Either way, you will need to enable MPXIO manually and ensure that
devices are properly renamed.  If you are not comfortable with this
proceedure talk with Chris Bayly or Kevin Strike.  This document might
be updated at a later date for the full procedure, but at the moment
I'm in the middle of a storage migration (I know, it figures).

#+BEGIN_EXAMPLE
stmsboot -D fp -e

# Unless you are on (SOME VERSIONS OF?!?) i386, then you would run:

stmsboot -e
#+END_EXAMPLE

Follow the prompts and allow the host to reboot.

Ensure that you see /changedisk after the reboot.  If not, reboot to
the correct side following the method needed from [[*Rebooting SPARC and x86 Architecture hosts.][Rebooting SPARC and
x86 Architecture hosts]].
* Fix up the md.tab 
Here we will be replacing the old emcpowerXc names for disks with their new MPXIO device names.

Backup the existing /etc/lvm/md.{tab|cf}

#+BEGIN_EXAMPLE
cd /etc/lvm/
cp md.tab md.tab.before-migration
cp md.cf md.cf.before-migration
#+END_EXAMPLE

Copy the md.cf to md.tab.  I know what you're saying at this point,
"but Chris, they look so different!"...  Trust me, copy the md.cf to
md.tab.

#+BEGIN_EXAMPLE
cp /etc/lvm/md.cf /etc/lvm/md.tab
#+END_EXAMPLE

Have the inq output you saved from before powerpath was removed, and
the current inq (after MPXIO was enabled) sitting nearby.

Edit the md.tab file such that all instances of emcpowerXc are
replaced with the new name for that lun.  For example in the old inq
output you might have a line that looks like this:

#+BEGIN_EXAMPLE
 /dev/rdsk/emcpower0c              :DGC     :RAID 5          :0326  :8C000094   :31457280 
#+END_EXAMPLE

You will need to match that (by the serial number) to the new device
name in the new inq output that might look like this:

#+BEGIN_EXAMPLE
/dev/rdsk/c0t6006016045AB1A005C092A5035A8DC11d0s2 :DGC     :RAID 5          :0326  :8C000094   :31457280
#+END_EXAMPLE

Check and recheck that the new long names are the correct replacements
for the original emcpowerXc names.  Any mixup here will likely lead to
the destruction of data.

* Fix the metadevices
For all of the metadevices that currently show an emcpower device
being attached, metaclear them.  This will be complicated by any soft
partitions that are built on top of them.

Find all of the soft partitions on the target disks. The following
code assumes that the target disks have "emcpower" names, you will
have to adapt this if the system uses WWN style naming conventions.

#+BEGIN_EXAMPLE
# for blah in `metastat -p | awk '/^d.*emcpo/ {print $1;}'` ; do metastat -c | egrep "(^ *$blah |$blah$)" ; done
d103             p   20GB d30
d104             p  1.1GB d30
d102             p  2.0GB d30
d101             p  500MB d30
d100             p  2.0GB d30
    d30          s   29GB /dev/dsk/emcpower0a
d125             p  8.0GB d31
d123             p   10GB d31
d124             p  1.1GB d31
d122             p  2.0GB d31
d121             p  500MB d31
d120             p  2.0GB d31
    d31          s   29GB /dev/dsk/emcpower1a
d83              p  1.8GB d34
d82              p   18GB d34
    d34          s   19GB /dev/dsk/emcpower6a
d162             p   22GB d33
d163             p   32GB d33
d164             p  1.1GB d33
d161             p  500MB d33
d160             p  2.0GB d33
    d33          s   79GB /dev/dsk/emcpower3a /dev/dsk/emcpower4c /dev/dsk/emcpower5c
#+END_EXAMPLE

If all of those devices make sense (they are partitions and slices
built on top of EMC power devices), then you can clear them, possibly
with a script like this:

#+BEGIN_EXAMPLE
# for blah in `metastat -p | awk '/^d.*emcpo/ {print $1;}'` ; do echo metaclear -pf $blah ; echo metaclear $blah ; done
metaclear -pf d30
metaclear -pf d31
metaclear -pf d32
metaclear -pf d33
metaclear -pf d34
#+END_EXAMPLE

Obviously you will have to cut/paste the output from the script to
actually clear the devices.

Once these are removed you can recreate them with the new device
names.  First we will check that the md.tab we created above makes
sense:

#+BEGIN_EXAMPLE
metainit -a -n
#+END_EXAMPLE

The output from this will show some errors about existing partitions
(d0, for example), but should not show any errors for the partitions
we would like to recreate.  If this passes the smell test, run the following:

#+BEGIN_EXAMPLE
metainit -a
#+END_EXAMPLE

Check that all of the metadevices (softpartitions and slices) have
been recreated.  If they haven't you will have to debug what happened
with the metainit, checking for errors in the output and possibly
/var/adm/messages

At least once I've had to create each of the top level metadevices
with a command like this:

#+BEGIN_EXAMPLE
metainit d32
#+END_EXAMPLE

Hopefully you will see a tree of devices pointing at MPXIO device
names, and soft partitions built on top of them, like this (and yes,
the disks shown here don't match previous examples):

#+BEGIN_EXAMPLE
d162             p   22GB d33
d163             p   32GB d33
d164             p  1.1GB d33
d161             p  500MB d33
d160             p  2.0GB d33
    d33          s   79GB /dev/dsk/c0t60060E8007DC40000030DC400000E42Ad0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E42Dd0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s0
#+END_EXAMPLE
