Exports/Storage2017-metamop.html
<div id="outline-container-org4d75f9e" class="outline-3">
<h3 id="org4d75f9e"><span class="section-number-3">8.1.</span> (Optionally) Reboot the host and reconfigure:</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Its generally possible to install MPXIO (the next step) before the
reboot of the system.  If you are unsure of the state of the system
after removing PowerPath, or otherwise don't feel comfortable with
this, reboot!
</p>

<pre class="example" id="orge212d89">
touch /reconfigure
</pre>

<p>
Then follow the reboot method needed from the section <a href="#orgbfeac8c">Rebooting SPARC and x86 Architecture hosts</a>.
Ensure that you see /changedisk after the reboot.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb2e821b" class="outline-2">
<h2 id="orgb2e821b"><span class="section-number-2">9.</span> Enable MPXIO</h2>
<div class="outline-text-2" id="text-9">
<p>
NOTE: This section does not apply to Solaris10 U4 and earlier.
stmsboot should be there in U4 but appears to be AWOL in the TELUS
image (or maybe it was missing in the U4 release we got 8 years ago?).
Either way, you will need to enable MPXIO manually and ensure that
devices are properly renamed.  If you are not comfortable with this
proceedure talk with Chris Bayly or Kevin Strike.  This document might
be updated at a later date for the full procedure, but at the moment
I'm in the middle of a storage migration (I know, it figures).
</p>

<pre class="example" id="org16c2317">
stmsboot -D fp -e

# Unless you are on (SOME VERSIONS OF?!?) i386, then you would run:

stmsboot -e
</pre>

<p>
Follow the prompts and allow the host to reboot.
</p>

<p>
Ensure that you see /changedisk after the reboot.  If not, reboot to
the correct side following the method needed from <a href="#orgbfeac8c">Rebooting SPARC and
x86 Architecture hosts</a>.
</p>
</div>
</div>
<div id="outline-container-orgd82c761" class="outline-2">
<h2 id="orgd82c761"><span class="section-number-2">10.</span> Fix up the md.tab</h2>
<div class="outline-text-2" id="text-10">
<p>
Here we will be replacing the old emcpowerXc names for disks with their new MPXIO device names.
</p>

<p>
Backup the existing /etc/lvm/md.{tab|cf}
</p>

<pre class="example" id="orgd59d0b0">
cd /etc/lvm/
cp md.tab md.tab.before-migration
cp md.cf md.cf.before-migration
</pre>

<p>
Copy the md.cf to md.tab.  I know what you're saying at this point,
"but Chris, they look so different!"&#x2026;  Trust me, copy the md.cf to
md.tab.
</p>

<pre class="example" id="orgdafd9b7">
cp /etc/lvm/md.cf /etc/lvm/md.tab
</pre>

<p>
Have the inq output you saved from before powerpath was removed, and
the current inq (after MPXIO was enabled) sitting nearby.
</p>

<p>
Edit the md.tab file such that all instances of emcpowerXc are
replaced with the new name for that lun.  For example in the old inq
output you might have a line that looks like this:
</p>

<pre class="example" id="org54616b3">
/dev/rdsk/emcpower0c              :DGC     :RAID 5          :0326  :8C000094   :31457280 
</pre>

<p>
You will need to match that (by the serial number) to the new device
name in the new inq output that might look like this:
</p>

<pre class="example" id="org9f8bb9c">
/dev/rdsk/c0t6006016045AB1A005C092A5035A8DC11d0s2 :DGC     :RAID 5          :0326  :8C000094   :31457280
</pre>

<p>
Check and recheck that the new long names are the correct replacements
for the original emcpowerXc names.  Any mixup here will likely lead to
the destruction of data.
</p>
</div>
</div>
<div id="outline-container-org16695ab" class="outline-2">
<h2 id="org16695ab"><span class="section-number-2">11.</span> Fix the metadevices</h2>
<div class="outline-text-2" id="text-11">
<p>
For all of the metadevices that currently show an emcpower device
being attached, metaclear them.  This will be complicated by any soft
partitions that are built on top of them.
</p>

<p>
Find all of the soft partitions on the target disks. The following
code assumes that the target disks have "emcpower" names, you will
have to adapt this if the system uses WWN style naming conventions.
</p>

<pre class="example" id="org9150880">
# for blah in `metastat -p | awk '/^d.*emcpo/ {print $1;}'` ; do metastat -c | egrep "(^ *$blah |$blah$)" ; done
d103             p   20GB d30
d104             p  1.1GB d30
d102             p  2.0GB d30
d101             p  500MB d30
d100             p  2.0GB d30
    d30          s   29GB /dev/dsk/emcpower0a
d125             p  8.0GB d31
d123             p   10GB d31
d124             p  1.1GB d31
d122             p  2.0GB d31
d121             p  500MB d31
d120             p  2.0GB d31
    d31          s   29GB /dev/dsk/emcpower1a
d83              p  1.8GB d34
d82              p   18GB d34
    d34          s   19GB /dev/dsk/emcpower6a
d162             p   22GB d33
d163             p   32GB d33
d164             p  1.1GB d33
d161             p  500MB d33
d160             p  2.0GB d33
    d33          s   79GB /dev/dsk/emcpower3a /dev/dsk/emcpower4c /dev/dsk/emcpower5c
</pre>

<p>
If all of those devices make sense (they are partitions and slices
built on top of EMC power devices), then you can clear them, possibly
with a script like this:
</p>

<pre class="example" id="org69957f9">
# for blah in `metastat -p | awk '/^d.*emcpo/ {print $1;}'` ; do echo metaclear -pf $blah ; echo metaclear $blah ; done
metaclear -pf d30
metaclear -pf d31
metaclear -pf d32
metaclear -pf d33
metaclear -pf d34
</pre>

<p>
Obviously you will have to cut/paste the output from the script to
actually clear the devices.
</p>

<p>
Once these are removed you can recreate them with the new device
names.  First we will check that the md.tab we created above makes
sense:
</p>

<pre class="example" id="org8a2c4ae">
metainit -a -n
</pre>

<p>
The output from this will show some errors about existing partitions
(d0, for example), but should not show any errors for the partitions
we would like to recreate.  If this passes the smell test, run the following:
</p>

<pre class="example" id="org102bb7b">
metainit -a
</pre>

<p>
Check that all of the metadevices (softpartitions and slices) have
been recreated.  If they haven't you will have to debug what happened
with the metainit, checking for errors in the output and possibly
/var/adm/messages
</p>

<p>
At least once I've had to create each of the top level metadevices
with a command like this:
</p>

<pre class="example" id="orgce16006">
metainit d32
</pre>

<p>
Hopefully you will see a tree of devices pointing at MPXIO device
names, and soft partitions built on top of them, like this (and yes,
the disks shown here don't match previous examples):
</p>

<pre class="example" id="org40bc560">
d162             p   22GB d33
d163             p   32GB d33
d164             p  1.1GB d33
d161             p  500MB d33
d160             p  2.0GB d33
    d33          s   79GB /dev/dsk/c0t60060E8007DC40000030DC400000E42Ad0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E42Dd0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s0
</pre>
</div>
</div>
