Exports/Storage2017-metamop.html
<div id="outline-container-org7871963" class="outline-2">
<h2 id="org7871963"><span class="section-number-2">12.</span> Preparation of destination (Hitachi) disks</h2>
<div class="outline-text-2" id="text-12">
<p>
Find all of the destination hitachi disks using "inq" making sure that
the WWN's on the list match what you are expecting:
</p>

<pre class="example" id="org0c196c7">
# inq -no_dots
Inquiry utility, Version V7.3-561 (Rev 1.0)      (SIL Version V5.5.1.0 (Edit Level 561)
Copyright (C) by EMC Corporation, all rights reserved.
For help type inq -h.
--------------------------------------------------------------------------------------------------------
DEVICE                                            :VEND    :PROD            :REV   :SER NUM    :CAP(kb)
--------------------------------------------------------------------------------------------------------
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Ad0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Bd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :57671680
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Cd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :57671680
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Dd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :78643200
/dev/rdsk/c0t60060E8007DC40000030DC400000E426d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E427d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E428d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E429d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t6006016045AB1A00B0D8CB1A09D1DC11d0s2 :DGC     :RAID 10         :0326  :ED0000D5   :20971520
/dev/rdsk/c0t6006016045AB1A00C01B4F8C35A8DC11d0s2 :DGC     :RAID 5          :0326  :8F000097   :31457280
/dev/rdsk/c0t6006016045AB1A00C6D46FEE07DFDC11d0s2 :DGC     :RAID 10         :0326  :EF000083   :52428800
/dev/rdsk/c0t6006016045AB1A00D8A7C26035A8DC11d0s2 :DGC     :RAID 5          :0326  :8D000095   :31457280
/dev/rdsk/c0t6006016045AB1A005C092A5035A8DC11d0s2 :DGC     :RAID 5          :0326  :8C000094   :31457280
/dev/rdsk/c0t6006016045AB1A00449CC07535A8DC11d0s2 :DGC     :RAID 5          :0326  :8E000096   :31457280
/dev/rdsk/c0t6006016045AB1A00941B70E307DFDC11d0s2 :DGC     :RAID 10         :0326  :EE000082   :52428800
/dev/rdsk/c0t6006016045AB1A0048807214CAEEDC11d0s2 :DGC     :RAID 5          :0326  :2600003B   :73400320
/dev/rdsk/c6t0d0s2                                :FUJITSU :MAY2073RCSUN72G :0501  :0733S0DA   :71687369
/dev/rdsk/c6t1d0s2                                :FUJITSU :MAY2073RCSUN72G :0501  :0733S0DB   :71687369
/dev/rdsk/c6t2d0s2                                :FUJITSU :MAY2073RCSUN72G :0501  :0734S0DD   :71687369
/dev/rdsk/c6t3d0s2                                :FUJITSU :MAY2073RCSUN72G :0501  :0734S0DD   :71687369
</pre>


<p>
For each disk, especially on x86, ensure that the new disks have disk
labels on them that allow full use by Solaris, this will allow the
disk to be labeled and slices created.
</p>

<pre class="example" id="org61de5d5">
fdisk -B /dev/rdsk/&lt;HITACHI DISK NAME&gt;
</pre>

<p>
Then create a Solaris slice at least one track into the disk. SVM will
prevent a disk from being added to the mirror if it has a disk label
(if you are trying to use a slice that starts at Sector/Track zero).
</p>

<p>
FIXME this has more to do with the existing disk, basically you can't
      mix labeled and non-labeled disks
</p>

<p>
Possibly use my script to do this (not completed at the writing of
this), or else take a look at the prtvtoc for the device, and create a
slice 0 that starts on the second track of the disk. For example here
is a disk that has the correct partition 0 created:
</p>

<pre class="example" id="org65d9894">
root@sedm1825:adm# prtvtoc /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s2
* /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s2 partition map
*
* Dimensions:
*     512 bytes/sector
*      63 sectors/track
*     255 tracks/cylinder
*   16065 sectors/cylinder
*    4567 cylinders
*    4565 accessible cylinders
*
* Flags:
*   1: unmountable
*  10: read-only
*
*                          First     Sector    Last
* Partition  Tag  Flags    Sector     Count    Sector  Mount Directory
      0      4    00      16065  73320660  73336724
      2      5    01          0  73336725  73336724
      8      1    01          0     16065     16064
</pre>

<p>
Note that partition 0 starts 16065 sectors into the disk (the same
number of sectors on a cylinder as stated earlier in the prtvtoc
output.
</p>
</div>
</div>
<div id="outline-container-org6968e0a" class="outline-2">
<h2 id="org6968e0a"><span class="section-number-2">13.</span> Mirroring the disks (why we are here&#x2026;)</h2>
<div class="outline-text-2" id="text-13">
<p>
There are two main scenarios you are likely to see for the mirroring
of the disks.  Take a look at the output of:
</p>

<pre class="example" id="orge1d8396">
metastat -c
</pre>

<p>
The SAN attached devices will either show up as mirrors or not.
</p>

<p>
Example of a mirrored device (note that the softpartitions are build
on top of the mirror device, not the concat/stripe d40:
</p>
<pre class="example" id="org270acdc">
d100             p  2.0GB d400
    d400         m   29GB d40
        d40      s   34GB /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s0
</pre>

<p>
Example of a non-mirrored device, you are more likely to run across
this.  In this example the softpartitions are build directly onto the
concat/stripe:
</p>
<pre class="example" id="orgff41ee7">
d162             p   22GB d33
d163             p   32GB d33
d164             p  1.1GB d33
d161             p  500MB d33
d160             p  2.0GB d33
    d33          s   79GB /dev/dsk/c0t60060E8007DC40000030DC400000E42Ad0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E42Dd0s0 /dev/dsk/c0t60060E8007DC40000030DC400000E429d0s0
</pre>

<p>
In either scenario there will be a lot of "determining as you go" to
figure out naming conventions for the devices you will create.  I
would highly suggest following any standard that already exists on the
host if at all possible, so there is the least surprise for future
SA's looking at the host.
</p>
</div>
<div id="outline-container-org90a2a98" class="outline-3">
<h3 id="org90a2a98"><span class="section-number-3">13.1.</span> Metadevices without existing mirror devices</h3>
<div class="outline-text-3" id="text-13-1">
<p>
We will be building a mirror device on top of the existing
concat/stripe device, so that we can add the hitachi devices and sync
to them.  When we are done we will remove the EMC disks, and leave the
remaining hitachi disk attached to the, now one-legged, mirror device.
Future migrations can use this mirror device to make their life easier.
</p>

<p>
For the examples below the disks d30 through d34 will be the original
EMC concat/stripe devices and the new hitachi devices will be d40
through d44, such that d30 and d40 are mirrored, and so on.
</p>
</div>
