MOP/Storage2017-metamop.org
*** Create a mapping of old to new devices
For each of the existing EMC backed metadevices we are going to want
to create a similar sized Hitachi backed metadevice.  Use the closest
(but larger) sized hitachi LUNs to the sizes of the EMC disks.

First, find the details about the existing disk, we are going to start
with d31, but this needs to be repeated for ALL of the affected
metadevices:

#+BEGIN_EXAMPLE
# metastat -c d31
d31              s  95GB /dev/dsk/c0t6006016045AB1A00C6D46FEE07DFDC11d0s0 /dev/dsk/c0t6006016045AB1A0048807214CAEEDC11d0s0
#+END_EXAMPLE

Note down the disk devices that make up the metadevice, and find the
sizes of those luns from inq, note that depending on how the disk was
being setup you might want to remove the slice number on the end of
the device name for easier grepping:

#+BEGIN_EXAMPLE
# inq -no_dots | egrep '(c0t6006016045AB1A00C6D46FEE07DFDC11d0|c0t6006016045AB1A0048807214CAEEDC11d0)'
/dev/rdsk/c0t6006016045AB1A00C6D46FEE07DFDC11d0s2 :DGC     :RAID 10         :0326  :EF000083   :52428800
/dev/rdsk/c0t6006016045AB1A0048807214CAEEDC11d0s2 :DGC     :RAID 5          :0326  :2600003B   :73400320
#+END_EXAMPLE

I used all the info here to create a chart like this (we'll get to how we chose Hitachi LUN's in a minute):

|------+---------------------+---------------------------------------------------------------------------------+-----+---------------------------------------------------------------------------------+--------|
| Orig |           Orig Size | EMC Disks                                                                       | New | Hitachi Disk                                                                    | Mirror |
|------+---------------------+---------------------------------------------------------------------------------+-----+---------------------------------------------------------------------------------+--------|
| d30  |            31457280 | c0t6006016045AB1A005C092A5035A8DC11d0s0                                         | d40 | c0t60060E8007DC40000030DC400000E429d0s0                                         | d400   |
| d31  | 52428800 + 31457280 | c0t6006016045AB1A00C6D46FEE07DFDC11d0s0 c0t6006016045AB1A0048807214CAEEDC11d0s0 | d41 | c0t60060E8007DC40000030DC400000E42Ad0s2 c0t60060E8007DC40000030DC400000E42Dd0s0 | d401   |
| d32  |            31457280 | c0t6006016045AB1A00449CC07535A8DC11d0s0                                         | d42 | c0t60060E8007DC40000030DC400000E428d0s0                                         | d402   |
| d33  |            31457280 | c0t6006016045AB1A00D8A7C26035A8DC11d0s0                                         | d43 | c0t60060E8007DC40000030DC400000E427d0s0                                         | d403   |
| d34  |            20971520 | c0t6006016045AB1A00B0D8CB1A09D1DC11d0s0                                         | d44 | c0t60060E8007DC40000030DC400000E426d0s0                                         | d404   |
| d142 |            52428800 | c0t6006016045AB1A00941B70E307DFDC11d0s0                                         | d45 | c0t60060E8007DC40000030DC400000E42Cd0s0                                         | d405   |
| d143 |            52428800 | c0t6006016045AB1A00C6D46FEE07DFDC11d0s0                                         | d46 | c0t60060E8007DC40000030DC400000E42Bd0s0                                         | d406   |
|------+---------------------+---------------------------------------------------------------------------------+-----+---------------------------------------------------------------------------------+--------|

Once the left hand side of this chart is filled in, you will want to
start matching the original lun sizes to the available Hitachi disks.
For example d30 shows that it is 31.4GB so the hitachi disk will need
to be slightly larger then that.  Lets look at the available disks:

#+BEGIN_EXAMPLE
# inq -no_dots | grep HITA | sort
/dev/rdsk/c0t60060E8007DC40000030DC400000E426d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E427d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E428d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E429d0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Ad0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :36700160
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Bd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :57671680
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Cd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :57671680
/dev/rdsk/c0t60060E8007DC40000030DC400000E42Dd0s2 :HITACHI :OPEN-V          :8001  :5030DC40   :78643200
#+END_EXAMPLE

The obvious choice given these disks is to take the first disk showing
a size of 36700160 and mark it down as the new destination/mirror for
d30, so put it into the chart and cross it off the list of available disks.

Choosing which disks will map to the originals is up to the reader.
In some cases you might not have the same number of destination luns
as source LUNs (i.e. if storage gave you a single 200gb LUN to replace
2 x 95GB luns).  You will have to determine what layout of disk fits
for what you have been given.

At this point you should have the chart above filled in with your
solution and are ready to continue.
*** Initialize the Hitachi disks
We will need to initialize the new metadevices for the Hitachi disks.
For metadevices backed by a single disk the command will look like the
following (with your metadevice name and disk device name of course!).

NOTE: we always use slice 0 here (created when you prepared the
Hitachi disk earlier) using slice 2 could prevent the mirror from
attaching later on.:

#+BEGIN_EXAMPLE
metainit d40 1 1 c0t60060E8007DC40000030DC400000E429d0s0
#+END_EXAMPLE

For metadevices that will be made up of more than one LUN, use the
appropriate metainit command to create a concatenation of the LUN's:

#+BEGIN_EXAMPLE
metainit d41 2 1 c0t60060E8007DC40000030DC400000E42Ad0s0 1 c0t60060E8007DC40000030DC400000E42Dd0s0
#+END_EXAMPLE

For three devices the command would look like "metainit dXX 3 1 ....."   and so on.

Repeat this for all of the new metadevices.
