Exports/Storage2017-metamop.html
<div id="outline-container-org2752316" class="outline-4">
<h4 id="org2752316"><span class="section-number-4">13.1.1.</span> Create a mapping of old to new devices</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
For each of the existing EMC backed metadevices we are going to want
to create a similar sized Hitachi backed metadevice.  Use the closest
(but larger) sized hitachi LUNs to the sizes of the EMC disks.
</p>

<p>
First, find the details about the existing disk, we are going to start
with d31, but this needs to be repeated for ALL of the affected
metadevices:
</p>

<pre class="example" id="orgcc2f2ca">
# metastat -c d31
d31              s  95GB /dev/dsk/c0t6006016045AB1A00C6D46FEE07DFDC11d0s0 /dev/dsk/c0t6006016045AB1A0048807214CAEEDC11d0s0
</pre>

<p>
Note down the disk devices that make up the metadevice, and find the
sizes of those luns from inq, note that depending on how the disk was
being setup you might want to remove the slice number on the end of
the device name for easier grepping:
</p>

<pre class="example" id="org1c44b0b">
